	.section .text
.LNDBG_TX:
# -- Machine type EFI2
# mark_description "Intel(R) C++ Compiler Professional for applications running on Intel(R) 64, Version 11.0    Build 20090131 %";
# mark_description "s";
# mark_description "-I/home/yaschenk/devel/internal/asm-trace/sra/search/linux -I/home/yaschenk/devel/internal/asm-trace/sra/sea";
# mark_description "rch/unix -I/home/yaschenk/devel/internal/asm-trace/sra/search -I/home/yaschenk/devel/internal/asm-trace/itf ";
# mark_description "-I/home/yaschenk/devel/internal/asm-trace/inc/icc/x86_64 -I/home/yaschenk/devel/internal/asm-trace/inc/icc -";
# mark_description "I/home/yaschenk/devel/internal/asm-trace/inc/gcc/x86_64 -I/home/yaschenk/devel/internal/asm-trace/inc/gcc -I";
# mark_description "/home/yaschenk/devel/internal/asm-trace/inc/linux -I/home/yaschenk/devel/internal/asm-trace/inc/unix -I/home";
# mark_description "/yaschenk/devel/internal/asm-trace/inc -c -S -o nucstrstr.pic.s -fPIC -g -Wall -D_DEBUGGING -DLINUX -DUNIX -";
# mark_description "D_GNU_SOURCE -D_REENTRANT -D_FILE_OFFSET_BITS=64 -MD";
	.file "nucstrstr.c"
	.text
..TXTST0:
# -- Begin  uint16_lsbit
# mark_begin;
       .align    2,0x90
uint16_lsbit:
# parameter 1(self): %edi
..B1.1:                         # Preds ..B1.0
..___tag_value_uint16_lsbit.2:                                  #
..LN1:
  .file   1 "/home/yaschenk/devel/internal/asm-trace/inc/gcc/x86_64/arch-impl.h"
   .loc    1  38
        pushq     %rbp                                          #38.1

//	DW_AT_high_pc:
	.8byte ..LN219
.DWinfo425:
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.2byte 0x035a
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x65736162
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000025dc
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x68
	.byte 0x00
	.byte 0x00
.DWinfo4:
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.2byte 0x0136
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000022ea
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.8byte 0x6f635f7061777362
	.2byte 0x7970
	.byte 0x00
	.8byte 0x5f383231746e6975
	.8byte 0x6f635f7061777362
	.2byte 0x7970
	.byte 0x00
//	DW_AT_low_pc:
	.8byte uint128_bswap_copy
//	DW_AT_high_pc:
	.8byte .LNuint128_bswap_copy
//	DW_AT_external:
	.byte 0x00
.DWinfo426:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0136
//	DW_AT_decl_column:
	.byte 0x26
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00002347
//	DW_AT_name:
	.2byte 0x6f74
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
.DWinfo427:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0136
//	DW_AT_decl_column:
	.byte 0x3b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000023d1
//	DW_AT_name:
	.4byte 0x6d6f7266
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x78
	.byte 0x00
.DWinfo3:
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.2byte 0x0125
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000022ea
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.4byte 0x61777362
	.2byte 0x0070
	.8byte 0x5f383231746e6975
	.4byte 0x61777362
	.2byte 0x0070
//	DW_AT_low_pc:
	.8byte uint128_bswap
//	DW_AT_high_pc:
	.8byte .LNuint128_bswap
//	DW_AT_external:
	.byte 0x00
.DWinfo428:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0125
//	DW_AT_decl_column:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00002347
//	DW_AT_name:
	.4byte 0x666c6573
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
	.byte 0x00
.DWinfo429:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x726f6873
	.2byte 0x0074
.DWinfo1:
//	DW_TAG_subprogram:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x25
//	DW_AT_decl_column:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000000d5
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x6c5f3631746e6975
	.4byte 0x74696273
	.byte 0x00
	.8byte 0x6c5f3631746e6975
	.4byte 0x74696273
	.byte 0x00
//	DW_AT_low_pc:
	.8byte uint16_lsbit
//	DW_AT_high_pc:
	.8byte .LNuint16_lsbit
//	DW_AT_external:
	.byte 0x00
.DWinfo430:
//	DW_TAG_formal_parameter:
	.byte 0x09
//	DW_AT_decl_line:
	.byte 0x25
//	DW_AT_decl_column:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000022c6
//	DW_AT_name:
	.4byte 0x666c6573
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x78
.DWinfo431:
//	DW_TAG_variable:
	.byte 0x0a
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x006e7472
//	DW_AT_type:
	.4byte 0x000000d5
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
	.byte 0x00
.DWinfo432:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_column:
	.byte 0x1c
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f3631746e6975
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000022d8
.DWinfo433:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.4byte 0x6f687320
	.2byte 0x7472
	.byte 0x00
.DWinfo434:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x64696f76
	.byte 0x00
.DWinfo2:
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.2byte 0x0105
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000022ea
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.4byte 0x00726873
	.8byte 0x5f383231746e6975
	.4byte 0x00726873
//	DW_AT_low_pc:
	.8byte uint128_shr
//	DW_AT_high_pc:
	.8byte .LNuint128_shr
//	DW_AT_external:
	.byte 0x00
.DWinfo435:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0105
//	DW_AT_decl_column:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00002347
//	DW_AT_name:
	.4byte 0x666c6573
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
.DWinfo436:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0105
//	DW_AT_decl_column:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000023af
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x78
	.byte 0x00
.DWinfo437:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x0000234c
.DWinfo438:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x63
//	DW_AT_decl_column:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.2byte 0x0074
//	DW_AT_type:
	.4byte 0x0000235f
.DWinfo439:
//	DW_TAG_structure_type:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0x64
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.2byte 0x0074
.DWinfo440:
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x66
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x6f6c
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000238c
.DWinfo441:
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x67
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.2byte 0x6968
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000238c
	.byte 0x00
.DWinfo442:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x38
//	DW_AT_decl_column:
	.byte 0x1b
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f3436746e6975
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000239e
.DWinfo443:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.4byte 0x6e6f6c20
	.2byte 0x0067
.DWinfo444:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x34
//	DW_AT_decl_column:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f3233746e6975
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000023c1
.DWinfo445:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.4byte 0x746e6920
	.byte 0x00
.DWinfo446:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x000023d6
.DWinfo447:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x0000234c
.DWinfo448:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x000022ea
.DWinfo5:
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.2byte 0x0315
//	DW_AT_decl_column:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_inline:
	.byte 0x00
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000023db
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x4172707845617473
	.4byte 0x636f6c6c
	.byte 0x00
	.8byte 0x614672745363754e
	.8byte 0x4172707845617473
	.4byte 0x636f6c6c
	.byte 0x00
//	DW_AT_low_pc:
	.8byte NucStrFastaExprAlloc
//	DW_AT_high_pc:
	.8byte .LNNucStrFastaExprAlloc
//	DW_AT_external:
	.byte 0x00
.DWinfo449:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0315
//	DW_AT_decl_column:
	.byte 0x25
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x0000246f
//	DW_AT_name:
	.2byte 0x7a73
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x68
.DWinfo450:
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.2byte 0x0317
//	DW_AT_decl_column:
	.byte 0x0b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x6574756f
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x000023db
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
.DWinfo451:
//	DW_TAG_lexical_block:
	.byte 0x05
//	DW_AT_decl_line:
	.2byte 0x0319
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_low_pc:
	.8byte ..LN45
//	DW_AT_high_pc:
	.8byte ..LN59
.DWinfo452:
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.2byte 0x031a
//	DW_AT_decl_column:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0065
//	DW_AT_type:
	.4byte 0x0000247f
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x60
	.byte 0x00
	.byte 0x00
.DWinfo453:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_column:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x657a6973
	.2byte 0x745f
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000239e
.DWinfo454:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002484
.DWinfo455:
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.2byte 0x02fa
//	DW_AT_decl_column:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x0072707845617473
//	DW_AT_type:
	.4byte 0x0000249e
.DWinfo456:
//	DW_TAG_structure_type:
	.byte 0x10
//	DW_AT_decl_line:
	.2byte 0x02fb
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x90
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x0072707845617473
.DWinfo457:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x02fd
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x65707974
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000024f8
.DWinfo458:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x02fe
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte 0x657a6973
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000023af
.DWinfo459:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0307
//	DW_AT_decl_column:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.2byte 0x0075
//	DW_AT_type:
	.4byte 0x00002510
.DWinfo460:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x030d
//	DW_AT_decl_column:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte 0x72657571
	.2byte 0x0079
//	DW_AT_type:
	.4byte 0x0000253e
	.byte 0x00
.DWinfo461:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_column:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00745f3233746e69
//	DW_AT_type:
	.4byte 0x00002509
.DWinfo462:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
.DWinfo463:
//	DW_TAG_union_type:
	.byte 0x12
//	DW_AT_decl_line:
	.2byte 0x0301
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x08
.DWinfo464:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0305
//	DW_AT_decl_column:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x6574756f
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x000023db
.DWinfo465:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x0306
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x67696c61
	.2byte 0x006e
//	DW_AT_type:
	.4byte 0x0000238c
	.byte 0x00
.DWinfo466:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00002547
//	DW_AT_byte_size:
	.byte 0x80
.DWinfo467:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
.DWinfo468:
//	DW_TAG_structure_type:
	.byte 0x16
//	DW_AT_decl_line:
	.2byte 0x030a
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x20
.DWinfo469:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x030b
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.8byte 0x006e726574746170
//	DW_AT_type:
	.4byte 0x00002574
.DWinfo470:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x030c
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte 0x6b73616d
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00002574
	.byte 0x00
.DWinfo471:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_column:
	.byte 0x03
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f74617063756e
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00002586
.DWinfo472:
//	DW_TAG_union_type:
	.byte 0x17
//	DW_AT_decl_line:
	.byte 0x42
//	DW_AT_decl_column:
	.byte 0x01
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x10
.DWinfo473:
//	DW_TAG_member:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x43
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0062
//	DW_AT_type:
	.4byte 0x000025d3
.DWinfo474:
//	DW_TAG_member:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0077
//	DW_AT_type:
	.4byte 0x000025fe
.DWinfo475:
//	DW_TAG_member:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x45
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00002607
.DWinfo476:
//	DW_TAG_member:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x006c
//	DW_AT_type:
	.4byte 0x00002610
.DWinfo477:
//	DW_TAG_member:
	.byte 0x18
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_column:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0073
//	DW_AT_type:
	.4byte 0x0000234c
	.byte 0x00
.DWinfo478:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000025dc
//	DW_AT_byte_size:
	.byte 0x10
.DWinfo479:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
.DWinfo480:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_column:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00745f38746e6975
//	DW_AT_type:
	.4byte 0x000025ed
.DWinfo481:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.4byte 0x61686320
	.2byte 0x0072
.DWinfo482:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000022c6
//	DW_AT_byte_size:
	.byte 0x10
.DWinfo483:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
.DWinfo484:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000023af
//	DW_AT_byte_size:
	.byte 0x10
.DWinfo485:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
.DWinfo486:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x0000238c
//	DW_AT_byte_size:
	.byte 0x10
.DWinfo487:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x01
	.byte 0x00
.DWinfo488:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x0000261e
.DWinfo489:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002623
.DWinfo490:
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.2byte 0x02df
//	DW_AT_decl_column:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x784572745363754e
	.2byte 0x7270
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00002638
.DWinfo491:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x747372745363754e
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x0000264b
.DWinfo492:
//	DW_TAG_union_type:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x0339
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x90
//	DW_AT_name:
	.8byte 0x747372745363754e
	.2byte 0x0072
.DWinfo493:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x033b
//	DW_AT_decl_column:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x74736166
	.2byte 0x0061
//	DW_AT_type:
	.4byte 0x00002484
.DWinfo494:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x033c
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.8byte 0x006e61656c6f6f62
//	DW_AT_type:
	.4byte 0x00002696
.DWinfo495:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.2byte 0x033d
//	DW_AT_decl_column:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x00627573
//	DW_AT_type:
	.4byte 0x00002705
	.byte 0x00
.DWinfo496:
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.2byte 0x0328
//	DW_AT_decl_column:
	.byte 0x1d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x704f72745363754e
	.4byte 0x72707845
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000026ad
.DWinfo497:
//	DW_TAG_structure_type:
	.byte 0x10
//	DW_AT_decl_line:
	.2byte 0x0329
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x18
//	DW_AT_name:
	.8byte 0x704f72745363754e
	.4byte 0x72707845
	.byte 0x00
.DWinfo498:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x032b
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x65707974
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000024f8
.DWinfo499:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x032c
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.2byte 0x706f
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000024f8
.DWinfo500:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x032d
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x7466656c
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000261e
.DWinfo501:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x032e
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte 0x68676972
	.2byte 0x0074
//	DW_AT_type:
	.4byte 0x0000261e
	.byte 0x00
.DWinfo502:
//	DW_TAG_typedef:
	.byte 0x0f
//	DW_AT_decl_line:
	.2byte 0x0331
//	DW_AT_decl_column:
	.byte 0x1e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x755372745363754e
	.4byte 0x70784562
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x0000271d
.DWinfo503:
//	DW_TAG_structure_type:
	.byte 0x10
//	DW_AT_decl_line:
	.2byte 0x0332
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_name:
	.8byte 0x755372745363754e
	.4byte 0x70784562
	.2byte 0x0072
.DWinfo504:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0334
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x65707974
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000024f8
.DWinfo505:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0335
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.2byte 0x706f
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000024f8
.DWinfo506:
//	DW_TAG_member:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0336
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x72707865
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000261e
	.byte 0x00
.DWinfo507:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002769
.DWinfo508:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x0000276e
.DWinfo509:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte 0x72616863
	.byte 0x00
.DWinfo510:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002509
.DWinfo511:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002780
.DWinfo512:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00002785
.DWinfo513:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x25
//	DW_AT_decl_column:
	.byte 0x16
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x38746e69
	.2byte 0x745f
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000276e
.DWinfo514:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x0000279a
.DWinfo515:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002638
.DWinfo516:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_column:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00693832316d5f5f
//	DW_AT_type:
	.4byte 0x000027b0
.DWinfo517:
//	DW_TAG_array_type:
	.byte 0x1a
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00693832316d5f5f
//	DW_AT_type:
	.4byte 0x000027cc
//	DW_AT_byte_size:
	.byte 0x10
.DWinfo518:
//	DW_TAG_subrange_type:
	.byte 0x1b
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00693832316d5f5f
//	DW_AT_upper_bound:
	.byte 0x01
//	DW_AT_lower_bound:
	.byte 0x00
	.byte 0x00
.DWinfo519:
//	DW_TAG_base_type:
	.byte 0x07
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.8byte 0x6f6c20676e6f6c20
	.2byte 0x676e
	.byte 0x00
.DWinfo17:
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.2byte 0x0850
//	DW_AT_decl_column:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000279f
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x75625f656d697270
	.8byte 0x616e325f72656666
	.byte 0x00
	.8byte 0x75625f656d697270
	.8byte 0x616e325f72656666
	.byte 0x00
//	DW_AT_low_pc:
	.8byte prime_buffer_2na
//	DW_AT_high_pc:
	.8byte .LNprime_buffer_2na
//	DW_AT_external:
	.byte 0x00
.DWinfo520:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0850
//	DW_AT_decl_column:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00002859
//	DW_AT_name:
	.4byte 0x00637273
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x70
.DWinfo521:
//	DW_TAG_formal_parameter:
	.byte 0x04
//	DW_AT_decl_line:
	.2byte 0x0850
//	DW_AT_decl_column:
	.byte 0x3f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00002859
//	DW_AT_name:
	.4byte 0x6f6e6769
	.2byte 0x6572
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x78
.DWinfo522:
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.2byte 0x0852
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x66667562
	.2byte 0x7265
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000279f
//	DW_AT_location:
	.2byte 0x7602
	.byte 0x60
	.byte 0x00
.DWinfo523:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x0000285e
.DWinfo524:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x000025dc
.DWinfo525:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002868
.DWinfo526:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00002484
.DWinfo527:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00002872
.DWinfo528:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x000022ea
.DWinfo529:
//	DW_TAG_typedef:
	.byte 0x02
//	DW_AT_decl_line:
	.byte 0x40
