	.section .text
.LNDBG_TX:
# -- Machine type IA32
# mark_description "Intel(R) C++ Compiler for applications running on IA-32, Version 10.1    Build 20081024 %s";
# mark_description "-I/home/yaschenk/devel/internal/asm-trace/sra/search/linux -I/home/yaschenk/devel/internal/asm-trace/sra/sea";
# mark_description "rch/unix -I/home/yaschenk/devel/internal/asm-trace/sra/search -I/home/yaschenk/devel/internal/asm-trace/itf ";
# mark_description "-I/home/yaschenk/devel/internal/asm-trace/inc/icc/i386 -I/home/yaschenk/devel/internal/asm-trace/inc/icc -I/";
# mark_description "home/yaschenk/devel/internal/asm-trace/inc/gcc/i386 -I/home/yaschenk/devel/internal/asm-trace/inc/gcc -I/hom";
# mark_description "e/yaschenk/devel/internal/asm-trace/inc/linux -I/home/yaschenk/devel/internal/asm-trace/inc/unix -I/home/rod";
# mark_description "armer/devel/internal/asm-trace/inc -c -S -o nucstrstr.pic.s -fPIC -g -Wall -D_DEBUGGING -DLINUX -DUNIX -D_GN";
# mark_description "U_SOURCE -D_REENTRANT -D_FILE_OFFSET_BITS=64 -MD";
	.file "nucstrstr.c"
	.data
	.text
..TXTST0:
# -- Begin  uint16_lsbit
# mark_begin;
       .align    2,0x90
uint16_lsbit:
# parameter 1(self): 8 + %ebp
..B1.1:                         # Preds ..B1.0
..___tag_value_uint16_lsbit.2:                                  #
..LN1:
        pushl     %ebp                                          #38.1
        movl      %esp, %ebp                                    #38.1
..___tag_value_uint16_lsbit.7:                                  #

//	DW_AT_const_value:
	.byte 0x03
.DWinfo49:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x616e325f65707974
	.4byte 0x0032335f
//	DW_AT_const_value:
	.byte 0x04
.DWinfo50:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x616e325f65707974
	.4byte 0x3832315f
	.byte 0x00
//	DW_AT_const_value:
	.byte 0x05
.DWinfo51:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x616e345f65707974
	.4byte 0x0036315f
//	DW_AT_const_value:
	.byte 0x06
.DWinfo52:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x616e345f65707974
	.4byte 0x0032335f
//	DW_AT_const_value:
	.byte 0x07
.DWinfo53:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x616e345f65707974
	.4byte 0x3832315f
	.byte 0x00
//	DW_AT_const_value:
	.byte 0x08
.DWinfo54:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x616e325f65707974
	.4byte 0x736f705f
	.byte 0x00
//	DW_AT_const_value:
	.byte 0x09
.DWinfo55:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x616e345f65707974
	.4byte 0x736f705f
	.byte 0x00
//	DW_AT_const_value:
	.byte 0x0a
.DWinfo56:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x00504f5f65707974
//	DW_AT_const_value:
	.byte 0x0b
.DWinfo57:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x5058455f65707974
	.2byte 0x0052
//	DW_AT_const_value:
	.byte 0x0c
.DWinfo58:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.4byte 0x4e5f706f
	.2byte 0x544f
	.byte 0x00
//	DW_AT_const_value:
	.byte 0x0d
.DWinfo59:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x00444145485f706f
//	DW_AT_const_value:
	.byte 0x0e
.DWinfo60:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.8byte 0x004c4941545f706f
//	DW_AT_const_value:
	.byte 0x0f
.DWinfo61:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.4byte 0x415f706f
	.2byte 0x444e
	.byte 0x00
//	DW_AT_const_value:
	.byte 0x10
.DWinfo62:
//	DW_TAG_enumerator:
	.byte 0x03
//	DW_AT_name:
	.4byte 0x4f5f706f
	.2byte 0x0052
//	DW_AT_const_value:
	.byte 0x11
	.byte 0x00
.DWinfo63:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x26
//	DW_AT_decl_column:
	.byte 0x14
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00745f3631746e69
//	DW_AT_type:
	.4byte 0x00000256
.DWinfo64:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x726f6873
	.2byte 0x0074
.DWinfo1:
//	DW_TAG_subprogram:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x25
//	DW_AT_decl_column:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000245
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x6c5f3631746e6975
	.4byte 0x74696273
	.byte 0x00
	.8byte 0x6c5f3631746e6975
	.4byte 0x74696273
	.byte 0x00
//	DW_AT_low_pc:
	.4byte uint16_lsbit
//	DW_AT_high_pc:
	.4byte .LNuint16_lsbit
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x000002b2
.DWinfo65:
//	DW_TAG_formal_parameter:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x25
//	DW_AT_decl_column:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000002b2
//	DW_AT_name:
	.4byte 0x666c6573
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x08
.DWinfo66:
//	DW_TAG_variable:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x006e7472
//	DW_AT_type:
	.4byte 0x00000245
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x7c
	.byte 0x00
.DWinfo67:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x32
//	DW_AT_decl_column:
	.byte 0x1c
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f3631746e6975
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000002c4
.DWinfo68:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.4byte 0x6f687320
	.2byte 0x7472
	.byte 0x00
.DWinfo69:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x64696f76
	.byte 0x00
.DWinfo2:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x0126
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000002d6
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.4byte 0x00726873
	.8byte 0x5f383231746e6975
	.4byte 0x00726873
//	DW_AT_low_pc:
	.4byte uint128_shr
//	DW_AT_high_pc:
	.4byte .LNuint128_shr
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x0000032f
.DWinfo70:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0126
//	DW_AT_decl_column:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000032f
//	DW_AT_name:
	.4byte 0x666c6573
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x08
.DWinfo71:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0126
//	DW_AT_decl_column:
	.byte 0x2e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000003a0
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x0c
	.byte 0x00
.DWinfo72:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00000334
.DWinfo73:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x63
//	DW_AT_decl_column:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.2byte 0x0074
//	DW_AT_type:
	.4byte 0x00000347
.DWinfo74:
//	DW_TAG_structure_type:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0x64
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.2byte 0x0074
//	DW_AT_sibling:
	.4byte 0x00000378
.DWinfo75:
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x66
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x6f6c
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000378
.DWinfo76:
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x67
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.2byte 0x6968
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000378
	.byte 0x00
.DWinfo77:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x3b
//	DW_AT_decl_column:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f3436746e6975
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000038a
.DWinfo78:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.8byte 0x6f6c20676e6f6c20
	.2byte 0x676e
	.byte 0x00
.DWinfo79:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x34
//	DW_AT_decl_column:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f3233746e6975
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000003b2
.DWinfo80:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.4byte 0x746e6920
	.byte 0x00
.DWinfo3:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x014c
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000002d6
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.4byte 0x61777362
	.2byte 0x0070
	.8byte 0x5f383231746e6975
	.4byte 0x61777362
	.2byte 0x0070
//	DW_AT_low_pc:
	.4byte uint128_bswap
//	DW_AT_high_pc:
	.4byte .LNuint128_bswap
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x00000409
.DWinfo81:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x014c
//	DW_AT_decl_column:
	.byte 0x21
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000032f
//	DW_AT_name:
	.4byte 0x666c6573
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x08
	.byte 0x00
.DWinfo4:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x0163
//	DW_AT_decl_column:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x000002d6
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x5f383231746e6975
	.8byte 0x6f635f7061777362
	.2byte 0x7970
	.byte 0x00
	.8byte 0x5f383231746e6975
	.8byte 0x6f635f7061777362
	.2byte 0x7970
	.byte 0x00
//	DW_AT_low_pc:
	.4byte uint128_bswap_copy
//	DW_AT_high_pc:
	.4byte .LNuint128_bswap_copy
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x00000469
.DWinfo82:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0163
//	DW_AT_decl_column:
	.byte 0x26
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000032f
//	DW_AT_name:
	.2byte 0x6f74
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x08
.DWinfo83:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0163
//	DW_AT_decl_column:
	.byte 0x3b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000469
//	DW_AT_name:
	.4byte 0x6d6f7266
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x0c
	.byte 0x00
.DWinfo84:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x0000046e
.DWinfo85:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000334
.DWinfo86:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_column:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00693832316d5f5f
//	DW_AT_type:
	.4byte 0x00000484
.DWinfo87:
//	DW_TAG_array_type:
	.byte 0x0f
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00693832316d5f5f
//	DW_AT_type:
	.4byte 0x0000038a
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_sibling:
	.4byte 0x000004a4
.DWinfo88:
//	DW_TAG_subrange_type:
	.byte 0x10
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00693832316d5f5f
//	DW_AT_upper_bound:
	.byte 0x01
//	DW_AT_lower_bound:
	.byte 0x00
	.byte 0x00
.DWinfo5:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x0850
//	DW_AT_decl_column:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000473
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x75625f656d697270
	.8byte 0x616e325f72656666
	.byte 0x00
	.8byte 0x75625f656d697270
	.8byte 0x616e325f72656666
	.byte 0x00
//	DW_AT_low_pc:
	.4byte prime_buffer_2na
//	DW_AT_high_pc:
	.4byte .LNprime_buffer_2na
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x00000517
.DWinfo89:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0850
//	DW_AT_decl_column:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000517
//	DW_AT_name:
	.4byte 0x00637273
//	DW_AT_location:
	.2byte 0x7302
	.byte 0x08
.DWinfo90:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0850
//	DW_AT_decl_column:
	.byte 0x3f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000517
//	DW_AT_name:
	.4byte 0x6f6e6769
	.2byte 0x6572
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7302
	.byte 0x0c
.DWinfo91:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0852
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x66667562
	.2byte 0x7265
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000473
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x68
	.byte 0x00
.DWinfo92:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x0000051c
.DWinfo93:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000521
.DWinfo94:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x31
//	DW_AT_decl_column:
	.byte 0x18
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00745f38746e6975
//	DW_AT_type:
	.4byte 0x00000532
.DWinfo95:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.8byte 0x64656e6769736e75
	.4byte 0x61686320
	.2byte 0x0072
.DWinfo6:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x0f95
//	DW_AT_decl_column:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_inline:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000473
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x75625f656d697270
	.8byte 0x616e345f72656666
	.byte 0x00
	.8byte 0x75625f656d697270
	.8byte 0x616e345f72656666
	.byte 0x00
//	DW_AT_low_pc:
	.4byte prime_buffer_4na
//	DW_AT_high_pc:
	.4byte .LNprime_buffer_4na
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x000005c7
.DWinfo96:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0f95
//	DW_AT_decl_column:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000517
//	DW_AT_name:
	.4byte 0x00637273
//	DW_AT_location:
	.2byte 0x7302
	.byte 0x08
.DWinfo97:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0f95
//	DW_AT_decl_column:
	.byte 0x3f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000517
//	DW_AT_name:
	.4byte 0x6f6e6769
	.2byte 0x6572
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7302
	.byte 0x0c
.DWinfo98:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0f97
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00706d74
//	DW_AT_type:
	.4byte 0x000005c7
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x58
.DWinfo99:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0f98
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x66667562
	.2byte 0x7265
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000473
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x68
	.byte 0x00
.DWinfo100:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_column:
	.byte 0x03
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x745f74617063756e
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000005d9
.DWinfo101:
//	DW_TAG_union_type:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x42
//	DW_AT_decl_column:
	.byte 0x01
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_sibling:
	.4byte 0x0000062a
.DWinfo102:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x43
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0062
//	DW_AT_type:
	.4byte 0x0000062a
.DWinfo103:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0077
//	DW_AT_type:
	.4byte 0x00000637
.DWinfo104:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x45
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000644
.DWinfo105:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x46
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x006c
//	DW_AT_type:
	.4byte 0x00000651
.DWinfo106:
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x47
//	DW_AT_decl_column:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0073
//	DW_AT_type:
	.4byte 0x00000334
	.byte 0x00
.DWinfo107:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000521
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_sibling:
	.4byte 0x00000637
.DWinfo108:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
.DWinfo109:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000002b2
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_sibling:
	.4byte 0x00000644
.DWinfo110:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
.DWinfo111:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000003a0
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_sibling:
	.4byte 0x00000651
.DWinfo112:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
.DWinfo113:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000378
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_sibling:
	.4byte 0x0000065e
.DWinfo114:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x01
	.byte 0x00
.DWinfo115:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x000002d6
.DWinfo7:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x0315
//	DW_AT_decl_column:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_inline:
	.byte 0x00
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x0000065e
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x4172707845617473
	.4byte 0x636f6c6c
	.byte 0x00
	.8byte 0x614672745363754e
	.8byte 0x4172707845617473
	.4byte 0x636f6c6c
	.byte 0x00
//	DW_AT_low_pc:
	.4byte NucStrFastaExprAlloc
//	DW_AT_high_pc:
	.4byte .LNNucStrFastaExprAlloc
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x000006e6
.DWinfo116:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0315
//	DW_AT_decl_column:
	.byte 0x25
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x000006e6
//	DW_AT_name:
	.2byte 0x7a73
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x08
.DWinfo117:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0317
//	DW_AT_decl_column:
	.byte 0x0b
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x6574756f
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x0000065e
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x70
.DWinfo118:
//	DW_TAG_lexical_block:
	.byte 0x16
//	DW_AT_decl_line:
	.2byte 0x0319
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_low_pc:
	.4byte ..LN121
//	DW_AT_high_pc:
	.4byte ..LN135
.DWinfo119:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x031a
//	DW_AT_decl_column:
	.byte 0x1a
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0065
//	DW_AT_type:
	.4byte 0x000006f6
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x6c
	.byte 0x00
	.byte 0x00
.DWinfo120:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x20
//	DW_AT_decl_column:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x657a6973
	.2byte 0x745f
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000003b2
.DWinfo121:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x000006fb
.DWinfo122:
//	DW_TAG_typedef:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x02fa
//	DW_AT_decl_column:
	.byte 0x20
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x0072707845617473
//	DW_AT_type:
	.4byte 0x00000715
.DWinfo123:
//	DW_TAG_structure_type:
	.byte 0x18
//	DW_AT_decl_line:
	.2byte 0x02fb
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x90
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x0072707845617473
//	DW_AT_sibling:
	.4byte 0x00000773
.DWinfo124:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x02fd
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x65707974
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000773
.DWinfo125:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x02fe
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte 0x657a6973
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000003a0
.DWinfo126:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x0307
//	DW_AT_decl_column:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.2byte 0x0075
//	DW_AT_type:
	.4byte 0x0000078b
.DWinfo127:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x030d
//	DW_AT_decl_column:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte 0x72657571
	.2byte 0x0079
//	DW_AT_type:
	.4byte 0x000007bd
	.byte 0x00
.DWinfo128:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x27
//	DW_AT_decl_column:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x00745f3233746e69
//	DW_AT_type:
	.4byte 0x00000784
.DWinfo129:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
.DWinfo130:
//	DW_TAG_union_type:
	.byte 0x1a
//	DW_AT_decl_line:
	.2byte 0x0301
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_sibling:
	.4byte 0x000007bd
.DWinfo131:
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.2byte 0x0305
//	DW_AT_decl_column:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x6574756f
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x0000065e
.DWinfo132:
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.2byte 0x0306
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x67696c61
	.2byte 0x006e
//	DW_AT_type:
	.4byte 0x00000378
	.byte 0x00
.DWinfo133:
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000007ca
//	DW_AT_byte_size:
	.byte 0x80
//	DW_AT_sibling:
	.4byte 0x000007ca
.DWinfo134:
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
.DWinfo135:
//	DW_TAG_structure_type:
	.byte 0x1c
//	DW_AT_decl_line:
	.2byte 0x030a
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x20
//	DW_AT_sibling:
	.4byte 0x000007fb
.DWinfo136:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x030b
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.8byte 0x006e726574746170
//	DW_AT_type:
	.4byte 0x000005c7
.DWinfo137:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x030c
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte 0x6b73616d
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000005c7
	.byte 0x00
.DWinfo8:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x0344
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_inline:
	.byte 0x00
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000784
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x4d72707845617473
	.4byte 0x32656b61
	.byte 0x00
	.8byte 0x614672745363754e
	.8byte 0x4d72707845617473
	.4byte 0x32656b61
	.byte 0x00
//	DW_AT_low_pc:
	.4byte NucStrFastaExprMake2
//	DW_AT_high_pc:
	.4byte .LNNucStrFastaExprMake2
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x000008ef
.DWinfo138:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0344
//	DW_AT_decl_column:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x000008ef
//	DW_AT_name:
	.4byte 0x72707865
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x08
.DWinfo139:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0344
//	DW_AT_decl_column:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000784
//	DW_AT_name:
	.8byte 0x6e6f697469736f70
	.2byte 0x6c61
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x0c
.DWinfo140:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0345
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000a46
//	DW_AT_name:
	.4byte 0x74736166
	.2byte 0x0061
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x10
.DWinfo141:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x0345
//	DW_AT_decl_column:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x000006e6
//	DW_AT_name:
	.4byte 0x657a6973
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x14
.DWinfo142:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0347
//	DW_AT_decl_column:
	.byte 0x0c
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x000006e6
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x64
.DWinfo143:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0348
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0065
//	DW_AT_type:
	.4byte 0x000008f4
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x6c
.DWinfo144:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0349
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x006e726574746170
//	DW_AT_type:
	.4byte 0x000005c7
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x44
.DWinfo145:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x0349
//	DW_AT_decl_column:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x6b73616d
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000005c7
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x54
.DWinfo146:
//	DW_TAG_lexical_block:
	.byte 0x16
//	DW_AT_decl_line:
	.2byte 0x0359
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_low_pc:
	.4byte ..LN191
//	DW_AT_high_pc:
	.4byte ..LN301
.DWinfo147:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x035a
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x65736162
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000521
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x78
	.byte 0x00
	.byte 0x00
.DWinfo148:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x000008f4
.DWinfo149:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x000008f9
.DWinfo150:
//	DW_TAG_typedef:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x02df
//	DW_AT_decl_column:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x784572745363754e
	.2byte 0x7270
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000090e
.DWinfo151:
//	DW_TAG_typedef:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x44
//	DW_AT_decl_column:
	.byte 0x19
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x747372745363754e
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x00000921
.DWinfo152:
//	DW_TAG_union_type:
	.byte 0x1d
//	DW_AT_decl_line:
	.2byte 0x0339
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x90
//	DW_AT_name:
	.8byte 0x747372745363754e
	.2byte 0x0072
//	DW_AT_sibling:
	.4byte 0x00000970
.DWinfo153:
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.2byte 0x033b
//	DW_AT_decl_column:
	.byte 0x15
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x74736166
	.2byte 0x0061
//	DW_AT_type:
	.4byte 0x000006fb
.DWinfo154:
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.2byte 0x033c
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.8byte 0x006e61656c6f6f62
//	DW_AT_type:
	.4byte 0x00000970
.DWinfo155:
//	DW_TAG_member:
	.byte 0x1b
//	DW_AT_decl_line:
	.2byte 0x033d
//	DW_AT_decl_column:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x00627573
//	DW_AT_type:
	.4byte 0x000009e3
	.byte 0x00
.DWinfo156:
//	DW_TAG_typedef:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0328
//	DW_AT_decl_column:
	.byte 0x1d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x704f72745363754e
	.4byte 0x72707845
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000987
.DWinfo157:
//	DW_TAG_structure_type:
	.byte 0x18
//	DW_AT_decl_line:
	.2byte 0x0329
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_name:
	.8byte 0x704f72745363754e
	.4byte 0x72707845
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x000009e3
.DWinfo158:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x032b
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x65707974
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000773
.DWinfo159:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x032c
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.2byte 0x706f
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000773
.DWinfo160:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x032d
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x7466656c
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000008f4
.DWinfo161:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x032e
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x0c
//	DW_AT_name:
	.4byte 0x68676972
	.2byte 0x0074
//	DW_AT_type:
	.4byte 0x000008f4
	.byte 0x00
.DWinfo162:
//	DW_TAG_typedef:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0331
//	DW_AT_decl_column:
	.byte 0x1e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x755372745363754e
	.4byte 0x70784562
	.2byte 0x0072
//	DW_AT_type:
	.4byte 0x000009fb
.DWinfo163:
//	DW_TAG_structure_type:
	.byte 0x18
//	DW_AT_decl_line:
	.2byte 0x0332
//	DW_AT_decl_column:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_byte_size:
	.byte 0x0c
//	DW_AT_name:
	.8byte 0x755372745363754e
	.4byte 0x70784562
	.2byte 0x0072
//	DW_AT_sibling:
	.4byte 0x00000a46
.DWinfo164:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x0334
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte 0x65707974
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000773
.DWinfo165:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x0335
//	DW_AT_decl_column:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.2byte 0x706f
	.byte 0x00
//	DW_AT_type:
	.4byte 0x00000773
.DWinfo166:
//	DW_TAG_member:
	.byte 0x19
//	DW_AT_decl_line:
	.2byte 0x0336
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte 0x72707865
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000008f4
	.byte 0x00
.DWinfo167:
//	DW_TAG_pointer_type:
	.byte 0x0b
//	DW_AT_type:
	.4byte 0x00000a4b
.DWinfo168:
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000a50
.DWinfo169:
//	DW_TAG_base_type:
	.byte 0x05
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte 0x72616863
	.byte 0x00
.DWinfo9:
//	DW_TAG_subprogram:
	.byte 0x09
//	DW_AT_decl_line:
	.2byte 0x03f7
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_inline:
	.byte 0x00
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000784
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x614672745363754e
	.8byte 0x4d72707845617473
	.4byte 0x34656b61
	.byte 0x00
	.8byte 0x614672745363754e
	.8byte 0x4d72707845617473
	.4byte 0x34656b61
	.byte 0x00
//	DW_AT_low_pc:
	.4byte NucStrFastaExprMake4
//	DW_AT_high_pc:
	.4byte .LNNucStrFastaExprMake4
//	DW_AT_external:
	.byte 0x00
//	DW_AT_sibling:
	.4byte 0x00000b4c
.DWinfo170:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x03f7
//	DW_AT_decl_column:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x000008ef
//	DW_AT_name:
	.4byte 0x72707865
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x08
.DWinfo171:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x03f7
//	DW_AT_decl_column:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000784
//	DW_AT_name:
	.8byte 0x6e6f697469736f70
	.2byte 0x6c61
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x0c
.DWinfo172:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x03f8
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x00000a46
//	DW_AT_name:
	.4byte 0x74736166
	.2byte 0x0061
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x10
.DWinfo173:
//	DW_TAG_formal_parameter:
	.byte 0x0a
//	DW_AT_decl_line:
	.2byte 0x03f8
//	DW_AT_decl_column:
	.byte 0x1f
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_type:
	.4byte 0x000006e6
//	DW_AT_name:
	.4byte 0x657a6973
	.byte 0x00
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x14
.DWinfo174:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x03fa
//	DW_AT_decl_column:
	.byte 0x0c
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x000006e6
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x64
.DWinfo175:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x03fb
//	DW_AT_decl_column:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0065
//	DW_AT_type:
	.4byte 0x000008f4
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x70
.DWinfo176:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x03fc
//	DW_AT_decl_column:
	.byte 0x0e
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.8byte 0x006e726574746170
//	DW_AT_type:
	.4byte 0x000005c7
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x44
.DWinfo177:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x03fc
//	DW_AT_decl_column:
	.byte 0x17
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x6b73616d
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000005c7
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x54
.DWinfo178:
//	DW_TAG_lexical_block:
	.byte 0x16
//	DW_AT_decl_line:
	.2byte 0x040c
//	DW_AT_decl_column:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_low_pc:
	.4byte ..LN621
//	DW_AT_high_pc:
	.4byte ..LN731
.DWinfo179:
//	DW_TAG_variable:
	.byte 0x11
//	DW_AT_decl_line:
	.2byte 0x040d
//	DW_AT_decl_column:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_accessibility:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x65736162
	.byte 0x00
//	DW_AT_type:
	.4byte 0x000002b2
//	DW_AT_location:
	.2byte 0x7502
	.byte 0x6c
	.byte 0x00
	.byte 0x00
.DWinfo10:
