/*===========================================================================
*
*                            PUBLIC DOMAIN NOTICE
*               National Center for Biotechnology Information
*
*  This software/database is a "United States Government Work" under the
*  terms of the United States Copyright Act.  It was written as part of
*  the author's official duties as a United States Government employee and
*  thus cannot be copyrighted.  This software/database is freely available
*  to the public for use. The National Library of Medicine and the U.S.
*  Government have not placed any restriction on its use or reproduction.
*
*  Although all reasonable efforts have been taken to ensure the accuracy
*  and reliability of the software and data, the NLM and the U.S.
*  Government do not and cannot warrant the performance or results that
*  may be obtained by using this software or data. The NLM and the U.S.
*  Government disclaim all warranties, express or implied, including
*  warranties of performance, merchantability or fitness for any particular
*  purpose.
*
*  Please cite the author in any work or product based on this material.
*
* ===========================================================================
*
*/
#define HANDLING_EXTENDED_HEADERS 0

#include <kfs/extern.h>
#include <klib/defs.h>
#include <klib/rc.h>
#include <kfs/file.h>
#include <kfs/mmap.h>
#include <kfs/arc.h>
#include <kfs/toc.h>
#include <kfs/tar.h>
#include <klib/log.h>
#include <klib/debug.h>


#define TAR_ID_LEN      (8)
typedef char    tar_id      [TAR_ID_LEN];

/* --------------------
 * Tar file size elements are 12 bytes long with 11 used
 * for octal characters making the maximum size of a file
 * for pure classic or Posix tar limited to 8 GBytes.  
 * Various tar utilities handle longer files in different
 * ways if at all.
 *
 * A length of 100 bytes would be stored as "00000000144".
 *
 * Links and some other special values are archived with a
 * length of zero and thus no data blocks.
 *
 * There is a '0' prefill and as terminating NUL.
 *
 * Older utilities might put preceding ' ' characters or
 * instead of pre-fill have post fill ' ' or NUL.
 *
 * GNU tar implmentations use alternative intrpretatopms of
 * this and possibly other fields using mime base 64 or
 * base 256 (big endian nonstandard sized binary)
 */
#define TAR_SIZE_LEN        (12)
typedef char    tar_size    [TAR_SIZE_LEN];
#define MAX_TAR_FILE_SIZE   (077777777777)

/* --------------------
 * Tar file modification/access/creation times are 12 bytes
 * long.  This holds 11 octal ASCII digits representing the
 * number of seconds since 01/01/1970 00:00 UTC.
 *
 * There is a '0' prefill and as terminating NUL.
 *
 * Older utilities might put preceding ' ' characters or
 * instead of pre-fill have post fill ' ' or NUL.
 */
#define TAR_TIME_LEN        (12)
typedef char    tar_time    [TAR_TIME_LEN];

/* --------------------
 * Tar has a weak checksum protection of part of the tar header
 * that is 8 bytes long and again uses 7 ASCII octal digits.
 *
 * There is a '0' prefill and as terminating NUL.
 *
 * Older utilities might put preceding ' ' characters or
 * instead of pre-fill have post fill ' ' or NUL.
 */
#define TAR_CSUM_LEN        (8)
typedef char    tar_csum    [TAR_CSUM_LEN];
#define csum_blanks     ("       ")

/* --------------------
 * The tar link is a single byte that expresses the type of file
 * or special value represented by this entry.
 */
typedef char    tar_link;

#define LINKS()                   \
    link_('\0',OLDNORMAL_FILE)    \
    link_('0',NORMAL_FILE)        \
    link_('1',HARD_LINK)          \
    link_('2',SYMBOLIC_LINK)      \
    link_('3',CHARACTER_SPECIAL)  \
    link_('4',BLOCK_SPECIAL)      \
    link_('5',DIRECTORY)          \
    link_('6',FIFO)               \
    link_('7',CONTIGUOUS_FILE)    \
    link_('A',SOLARIS_ACL)        \
    link_('D',GNU_DUMPDIR)        \
    link_('E',SOLARIS_ACL_FILE)   \
    link_('I',INODE_METADATA)     \
    link_('K',NEXT_LONG_LINK)     \
    link_('L',NEXT_LONG_NAME)     \
    link_('M',MULTI_VOLUME)       \
    link_('N',GNU1989_LONG_NAMES) \
    link_('S',SPARSE)             \
    link_('V',VOLUME_NAME)        \
    link_('X',SUN_XHDR)           \
    link_('g',PAX_GLOBAL_XHDR)    \
    link_('x',PAX_XHDR)

#define link_(v,n)      PASTE_2(LINK_,n) = v,

/* LINK_COUNT is a count not a mac value */
enum e_tar_link
{
    LINKS()
    LINK_COUNT
};
#undef link_

#if _DEBUGGING
#define link_(v,n) {STRINGIFY(n), v},
struct nv_pair
{
    const char * name;
    tar_link  link;
};
static const char * get_link_string(tar_link l)
{
    static const struct nv_pair pairs[] = 
        {
            LINKS()
            {NULL, 0}
        };
    unsigned int ix;

    for (ix = 0; pairs[ix].name != NULL; ++ix)
        if (pairs[ix].link == l)
            return pairs[ix].name;
    return "UNDEFINED";
}
#undef link_
#endif
#undef LINKS


/* --------------------
 * The tar magic string is 6 bytes long.
 */
#define TAR_MAGIC_LEN       (6)
typedef char    tar_magic   [TAR_MAGIC_LEN];
#define POSIX_MAGIC_CONST   "ustar"     /* includes terminating NUL */

/* --------------------
 * The tar version string is two bytes long and uses both bytes
 */
#define TAR_VERSION_LEN     (2)
typedef char    tar_version [TAR_VERSION_LEN];
#define POSIX_VERSION_CONST "00"        /* does not include terminating NUL */

/* --------------------
 * The Posix strong user/group name is 32 bytes long
 */
#define TAR_STRNAME_LEN     (32)
typedef char    tar_strname [TAR_STRNAME_LEN];

/* --------------------
 * The dev? strings are 8 bytes long
 */
#define TAR_DEV_LEN     (8)
typedef char    tar_dev     [TAR_DEV_LEN];

/* --------------------
 * Posix prefix is 155 bytes that can be put before the name to give a path of
 * 255 bytes instad of the smaller limit of 99.
 */
#define TAR_PREFIX_LEN      (155)
typedef char    tar_prefix  [TAR_PREFIX_LEN];

/*
 * Sun extensions
 */

/* --------------------
 */
typedef char sun_extnum;
#define SUN_FULLSIZE_LEN    (10)
typedef char    sun_fullsize    [SUN_FULLSIZE_LEN];

/* --------------------
 * star extensions
 *
 * star85 is old star from 1985
 */
typedef char    star85_version;
#define STAR85_FILETYPE_LEN (8)
typedef char    star85_filetype [STAR85_FILETYPE_LEN];
#define STAR85_TYPE_LEN     (12)
typedef char    star85_type [STAR85_TYPE_LEN];
#define STAR85_RDEV_LEN     (12)
typedef char    star85_rdev [STAR85_RDEV_LEN];
/* ignoring the 11 byte rdev with minor bits */
#define STAR85_UNAME_LEN    (16)
typedef char    star85_uname    [STAR85_UNAME_LEN];
#define STAR85_GNAME_LEN    (15)
typedef char    star85_gname    [STAR85_GNAME_LEN];
#define STAR_XMAGIC_LEN     (4)
typedef char    star_magic  [STAR_XMAGIC_LEN];
#define STAR_MAGIC_CONST    ("tar")
#define NSTAR_PREFIX_LEN    (1)
typedef char    nstar_prefix    [NSTAR_PREFIX_LEN];

/* --------------------
 * gnu extensions
 */
#define GNU89_MAGIC_LEN     (8)
typedef char    gnu89_magic [GNU89_MAGIC_LEN];
#define GNU_89_MAGIC_CONST  "ustar  "       /* includes terminating NUL */
#define GNU_89_GNUMAGIC_CONST   "GNUtar "       /* includes terminating NUL */
#define GNU89_LONGNAMES_LEN (4)
typedef char    gnu89_longnames [GNU89_LONGNAMES_LEN];


/* --------------------
 * shared between the feuding star and gnu tar
 */
typedef char    tar_isextended ;
typedef struct  tar_sparse
{
    tar_size    offset;
    tar_size    num_bytes;
} tar_sparse;
#define GNU_SPARSES_IN_EXTRA_HEADER     (16)
#define GNU_SPARSES_IN_OLD_HEADER       (4)
#define GNU_SPARSES_IN_SPARSE_HEADER        (21)
#define STAR_SPARSES_IN_HEADER          (4)
#define STAR_SPARSES_IN_EXT_HEADER      (21)


/* ----------------------------------------
 * The various tar header formats
 *
 * Note that in all the tar, posix and pax formats the first 257 bytes are
 * the same.  In all posix ad almost compliant formats the first
 * 345 bytes are the same (except GNU 89).  It is abuse of the 155
 * bytes of the prefix that make star and gnu truly not posix compliant
 * Sun used the 12 bytes after the prefix so is still psox compliant.
 */
typedef struct  tar_v7_header
{
    /* type     member name          and offset */
    tar_file_name   name;               /*   0 */
    tar_file_mode   mode;               /* 100 */
    tar_id      uid;                /* 108 */
    tar_id      gid;                /* 116 */
    tar_size        size;               /* 124 */
    tar_time        mtime;              /* 136 */
    tar_csum        csum;               /* 148 */
    tar_link        link;               /* 156 */
    tar_file_name   linkname;           /* 157 */
    /* end of header                    // 257 */
} tar_v7_header;

typedef struct tar_posix_header
{
    /* type     member name          and offset */
    tar_file_name   name;               /*   0 */
    tar_file_mode   mode;               /* 100 */
    tar_id      uid;                /* 108 */
    tar_id      gid;                /* 116 */
    tar_size        size;               /* 124 */
    tar_time        mtime;              /* 136 */
    tar_csum        csum;               /* 148 */
    tar_link        link;               /* 156 */
    tar_file_name   linkname;           /* 157 */
    tar_magic       magic;              /* 257 */
    tar_version     version;            /* 263 */
    tar_strname     uname;              /* 265 */
    tar_strname     gname;              /* 297 */
    tar_dev     devmajor;           /* 329 */
    tar_dev     devminor;           /* 337 */
    tar_prefix      prefix;             /* 345 */
    /* end of header                    // 500 */
} tar_posix_header, tar_pax_header;

typedef struct tar_sun_header
{
    /* type     member name          and offset */
    tar_file_name   name;               /*   0 */
    tar_file_mode   mode;               /* 100 */
    tar_id      uid;                /* 108 */
    tar_id      gid;                /* 116 */
    tar_size        size;               /* 124 */
    tar_time        mtime;              /* 136 */
    tar_csum        csum;               /* 148 */
    tar_link        link;               /* 156 */
    tar_file_name   linkname;           /* 157 */
    tar_magic       magic;              /* 257 */
    tar_version     version;            /* 263 */
    tar_strname     uname;              /* 265 */
    tar_strname     gname;              /* 297 */
    tar_dev     devmajor;           /* 329 */
    tar_dev     devminor;           /* 337 */
    tar_prefix      prefix;             /* 345 */
    sun_extnum      extnum;             /* 500 non-conformant */
    sun_extnum      extcount;           /* 501 non-conformant */
    sun_fullsize    fullsize;           /* 502 non-conformant */
    /* end of header                    // 512 non-conformant */
} tar_sun_header;

typedef struct tar_star_85_header
{
    /* type     member name          and offset */
    tar_file_name   name;               /*   0 */
    tar_file_mode   mode;               /* 100 */
    tar_id      uid;                /* 108 */
    tar_id      gid;                /* 116 */
    tar_size        size;               /* 124 */
    tar_time        mtime;              /* 136 */
    tar_csum        csum;               /* 148 */
    tar_link        link;               /* 156 */
    tar_file_name   linkname;           /* 157 */
    star85_version  starversion;            /* 257 non-conformant */
    star85_filetype starfiletype;           /* 258 internal type of file? non-conformant */
    star85_type     startype;           /* 266 type of file (UNIX)? non-conformant */
    star85_rdev     rdev;               /* 278 non-conformant */
    tar_time        atime;              /* 290 non-conformant */
    tar_time        ctime;              /* 302 non-conformant */
    star85_uname    uname;              /* 314 non-conformant */
    star85_gname    gname;              /* 330 non-conformant */
    tar_prefix      prefix;             /* 345 non-conformant */
    char        ___fill0[8];            /* 500 non-conformant */
    star_magic      xmagic;             /* 508 non-conformant */
    /* end of header                    // 512 non-conformant */
} tar_star_85_header;
typedef struct tar_star_94_header
{
    /* type     member name          and offset */
    tar_file_name   name;               /*   0 */
    tar_file_mode   mode;               /* 100 */
    tar_id      uid;                /* 108 */
    tar_id      gid;                /* 116 */
    tar_size        size;               /* 124 */
    tar_time        mtime;              /* 136 */
    tar_csum        csum;               /* 148 */
    tar_link        link;               /* 156 */
    tar_file_name   linkname;           /* 157 */
    tar_magic       magic;              /* 257 */
    tar_version     version;            /* 263 */
    tar_strname     uname;              /* 265 */
    tar_strname     gname;              /* 297 */
    tar_dev     devmajor;           /* 329 */
    tar_dev     devminor;           /* 337 */
    nstar_prefix    prefix;             /* 345 */
    char        ___fill0;           /* 346 */
    char        ___fill1[8];            /* 347 */
    tar_isextended  isextended;         /* 355 non-conformant */
    tar_sparse      sparse[STAR_SPARSES_IN_HEADER]; /* 356 non-conformant */
    tar_size        realsize;           /* 452 non-conformant */
    tar_size        offset;             /* 464 non-conformant */
    tar_time        atime;              /* 476 non-conformant */
    tar_time        ctime;              /* 488 non-conformant */
    char        ___fill2[8];            /* 500 */
    star_magic      xmagic;             /* 508 non-conformant */
    /* end of header                    // 512 */
} tar_star_94_header;

typedef struct tar_gnu_89_header
{
    /* type     member name          and offset */
    tar_file_name   name;               /*   0 */
    tar_file_mode   mode;               /* 100 */
    tar_id      uid;                /* 108 */
    tar_id      gid;                /* 116 */
    tar_size        size;               /* 124 */
    tar_time        mtime;              /* 136 */
    tar_csum        csum;               /* 148 */
    tar_link        link;               /* 156 */
    tar_file_name   linkname;           /* 157 */
    gnu89_magic     magic;              /* 257 non-conformant */
    tar_strname     uname;              /* 265 */
    tar_strname     gname;              /* 297 */
    tar_dev     devmajor;           /* 329 */
    tar_dev     devminor;           /* 337 */
    tar_time        atime;              /* 345 non-conformant */
    tar_time        ctime;              /* 357 non-conformant */
    tar_size        offset;             /* 369 non-conformant */
    gnu89_longnames longnames;          /* 381 non-conformant */
    char        ___fill0[1];            /* 385 */
    tar_sparse      sparse  [GNU_SPARSES_IN_OLD_HEADER];/* 386 optional sparse */
    tar_isextended  isextended;         /* 482 non-conformant */
    tar_size        realsize;           /* 483 non-conformant */
    /* end of header                    // 495 */
} tar_gnu_89_header;

typedef struct tar_gnu_99_header
{
    /* type     member name          and offset */
    tar_file_name   name;               /*   0 */
    tar_file_mode   mode;               /* 100 */
    tar_id      uid;                /* 108 */
    tar_id      gid;                /* 116 */
    tar_size        size;               /* 124 */
    tar_time        mtime;              /* 136 */
    tar_csum        csum;               /* 148 */
    tar_link        link;               /* 156 */
    tar_file_name   linkname;           /* 157 */
    gnu89_magic     magic;              /* 257 non-conformant */
    tar_strname     uname;              /* 265 */
    tar_strname     gname;              /* 297 */
    tar_dev     devmajor;           /* 329 */
    tar_dev     devminor;           /* 337 */
    tar_time        atime;              /* 345 non-conformant */
    tar_time        ctime;              /* 357 non-conformant */
    tar_size        offset;             /* 369 non-conformant */
    gnu89_longnames longnames;          /* 381 non-conformant */
    char        ___fill0[1];            /* 385 */
    tar_sparse      sparse  [GNU_SPARSES_IN_OLD_HEADER];/* 386 non-conformant optional sparse */
    tar_isextended  isextended;         /* 482 non-conformant */
    tar_size        realsize;           /* 483 non-conformant */
    /* end of header                    // 495 */
} tar_gnu_99_header;

typedef struct tar_sparse_header
{
    /* type     member name          and offset */
    tar_sparse      sparse  [STAR_SPARSES_IN_EXT_HEADER];/* 0 */
    tar_isextended  isextended;         /* 504 */
} tar_sparse_header;                    /* 505 end of header */

typedef struct tar_cpio_header
{
    /* type     member name          and offset */
    char        magic       [6];        /*   0  must be "070707" */
#define TAR_CPIO_MAGIC_CONST ("070707")
    char        dev     [6];        /*   6  (dev,ino) is unique for each file in archive */
    char        ino     [6];        /*  12  see dev */
    char        mode        [6];        /*  18 */
    char        uid     [6];        /*  24 */
    char        gif     [6];        /*  30 */
    char        nlink       [6];        /*  36 */
    char        rdev        [6];        /*  42 */
    char        mtime       [11];       /*  48 */
    char        namesize    [6];        /*  59 */
    char        filesize    [6];        /*  65 */
    char        buff        [1];        /*  71  name and file data */
} tar_cpio_header;

typedef union tar_header
{
    /* ----------
     * The TAR header is to be zero filled by definition but some tar
     * programs use ' ' instead.
     *
     * accept zeros ('0'), spaces (' ') or NULs (0x00) as equivalent where reasonable
     *
     * This name refers to the entire header as a single undifferentiated
     * sequence of bytes.
     */
    tar_raw_block   raw;        /* tar block as an array of bytes: used for 0 blocks here */
    tar_cpio_header cpio;       /* cpio not really tar */
    tar_v7_header   tar;        /* classic header back to the beginnings of memory */
    tar_posix_header    posix;      /* ustar or Posix 1003.1 header */
    tar_sun_header  suntar;     /* Sun Microsystems tar header */
    tar_star_85_header  star_85;    /* star header from 1985 (pre-Posix) */
